[
  {
    "img": "project1.jpg",
    "imgMobile": "./images/project1/project1-mobile.png",
    "imgWeb": "./images/project1/project1-web.jpg",
    "title": "HappyHandsMnl",
    "link": "www.thehappyhandsmnl.com",
    "repository": "www.github.com/binoiii/happyhandsmnl-app",
    "description": "Eco-personalized souvenirs e-commerce website",
    "slug": "happyhandsmnl",
    "specification": "Happyhandsmnl's website showcases the company's wide array of eco-friedly products. Since the primary service of the company is personalization, the user can tryout different set of fonts that best suit his purchase. The user can also place his order/s in the website.",
    "responsibilities": [
      "Full Stack Development",
      "Layout, UI and UX design",
      "Responsive Design",
      "Deployment"
    ],
    "challenges": "This was my first project that was created from scratch.  For example, the modals, navigation bar and the others were created without the use of framework such as Tailwind and Bootstrap. The touch events and other functionalities were created from vanilla JavaScript. It may look like reinventing the wheel but the goal in mind is to fully grasp the fundamentals of HTML, CSS and JavaScript. Also, to deeply understand how things work behind. It was a great opportunity for learning because it allowed me to have a solid understanding of the basics. As a result, it provided me to have the flexibility of learning or using a new framework. In line with this, the project was created with React. Instead of trying to learn React through tutorials and replicating the project incorporated on it, I preferred to study React in such fashion because experiencing bugs and debugging is a skill that as important as learning the library. With thorough research, I have used different React hooks such as useRef, useEffect and the others.",
    "technologies": [
      "JavaScript",
      "React",
      "Redux",
      "HTML5",
      "CSS3",
      "Netlify",
      "Facebook Messenger"
    ]
  },
  {
    "img": "project2.jpg",
    "imgMobile": "./images/project2/project2-mobile.png",
    "imgWeb": "./images/project2/project2-web.jpg",
    "title": "Zion Philippines",
    "link": "www.zion-ph.com",
    "repository": "www.github.com/binoiii/zionph-app",
    "description": "Modern massage chairs e-commerce website",
    "slug": "zionphilippines",
    "specification": "Zion Philippines’s website serves as a product catalogue which includes the company profile, client reviews and the satisfied customers. The user can directly order a product and contact the company for any questions.",
    "responsibilities": [
      "Full Stack Development",
      "Layout, UI and UX design",
      "Responsive Design",
      "Deployment"
    ],
    "challenges": "The challenges for the project are strict deadline due to the website must go live prior to the start of the holiday season and no prior experience with Gatsby technology. Instead, I took it as an opportunity to further improve my skills in working well under great pressure and being able to work and learn new technologies in faster phase. As a result, the client was delighted with the outcome of the website particularly to its performance, design and seamless user experience.",
    "technologies": [
      "JavaScript",
      "React",
      "Gatsby",
      "HTML5",
      "React Bootstrap",
      "CSS3",
      "Netlify",
      "Facebook Messenger",
      "Session Token"
    ]
  },
  {
    "img": "project3.jpg",
    "imgMobile": "./images/project3/project3-mobile.png",
    "imgWeb": "./images/project3/project3-web.jpg",
    "title": "TODOS App",
    "link": "www.todos-app-mern.herokuapp.com",
    "repository": "www.github.com/binoiii/todos-app",
    "description": "To do list application",
    "slug": "todosapp",
    "specification": "A fullstack todo application with user authentication via JWT and the utilization of React Context API.",
    "responsibilities": [
      "Full Stack Development",
      "Layout, UI and UX design",
      "Responsive Design",
      "Deployment"
    ],
    "challenges": "Todos application was my first full stack development project. As a front end developer, learning the basic building blocks of the backend of the application will allow me to further understand how web applications work holistically. The application features RESTful web services and user authentication through JWT. In addition, to manage the data, Context API was utilised. Creating a full stack project poses a number of challenges. However, every challenges encountered was worth solving because it fructified to new skills and learnings unlocked.",
    "technologies": [
      "JavaScript",
      "React",
      "React Router",
      "JWT Tokens",
      "Express",
      "Node",
      "HTML5",
      "CSS3",
      "UI/UX",
      "Netlify",
      "Heroku"
    ]
  },
  {
    "img": "project4.jpg",
    "imgMobile": "./images/project4/project4-mobile.png",
    "imgWeb": "./images/project4/project4-web.jpg",
    "title": "Navmin",
    "link": "www.navmin.netlify.app",
    "repository": "www.github.com/binoiii/navmin-cms-admin.comm",
    "description": "Admin dashboard panel",
    "slug": "navmin",
    "specification": "A front-end application created using bootstrap.",
    "responsibilities": [
      "Full Stack Development",
      "Responsive Design",
      "User Experience",
      "Deployment"
    ],
    "technologies": ["Bootstrap", "HTML5", "CSS3", "UI/UX", "Netlify"]
  }
]
